#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_address.ip-add will be created
  + resource "google_compute_address" "ip-add" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "external-ip"
      + network_tier       = (known after apply)
      + project            = "terraform-project0987"
      + purpose            = (known after apply)
      + region             = (known after apply)
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + users              = (known after apply)
    }

  # google_compute_firewall.firewall will be created
  + resource "google_compute_firewall" "firewall" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "allow-ssh-icmp-rdp-http"
      + network            = "my-network"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + source_tags        = [
          + "web",
        ]

      + allow {
          + ports    = [
              + "80",
              + "8080",
              + "22",
              + "3386",
            ]
          + protocol = "tcp"
        }
      + allow {
          + ports    = []
          + protocol = "icmp"
        }
    }

  # google_compute_instance.my-vm will be created
  + resource "google_compute_instance" "my-vm" {
      + can_ip_forward          = false
      + cpu_platform            = (known after apply)
      + current_status          = (known after apply)
      + deletion_protection     = false
      + guest_accelerator       = (known after apply)
      + id                      = (known after apply)
      + instance_id             = (known after apply)
      + label_fingerprint       = (known after apply)
      + machine_type            = "f1-micro"
      + metadata_fingerprint    = (known after apply)
      + metadata_startup_script = <<-EOT
            #!/bin/bash
            apt update
            apt install apache2 -y
        EOT
      + min_cpu_platform        = (known after apply)
      + name                    = "apache-vm"
      + project                 = (known after apply)
      + self_link               = (known after apply)
      + tags                    = [
          + "web",
        ]
      + tags_fingerprint        = (known after apply)
      + zone                    = "us-central1-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "debian-cloud/debian-9"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      + network_interface {
          + ipv6_access_type   = (known after apply)
          + name               = (known after apply)
          + network            = "my-network"
          + network_ip         = (known after apply)
          + stack_type         = (known after apply)
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + min_node_cpus       = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

  # google_project.my-first-project will be created
  + resource "google_project" "my-first-project" {
      + auto_create_network = true
      + billing_account     = "01AB17-BB7540-D38976"
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "terraform-project0987"
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "terraform-project0987"
      + skip_delete         = (known after apply)
    }

  # google_project_service.service["cloudbilling.googleapis.com"] will be created
  + resource "google_project_service" "service" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "terraform-project0987"
      + service            = "cloudbilling.googleapis.com"
    }

  # google_project_service.service["cloudresourcemanager.googleapis.com"] will be created
  + resource "google_project_service" "service" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "terraform-project0987"
      + service            = "cloudresourcemanager.googleapis.com"
    }

  # google_project_service.service["compute.googleapis.com"] will be created
  + resource "google_project_service" "service" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "terraform-project0987"
      + service            = "compute.googleapis.com"
    }

  # google_project_service.service["storage.googleapis.com"] will be created
  + resource "google_project_service" "service" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "terraform-project0987"
      + service            = "storage.googleapis.com"
    }

  # google_service_account.name will be created
  + resource "google_service_account" "name" {
      + account_id   = "terraform-sa"
      + disabled     = false
      + display_name = "terraform-sa"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "terraform-project0987"
      + unique_id    = (known after apply)
    }

  # google_service_account_iam_member.role-binding["roles/billing.user"] will be created
  + resource "google_service_account_iam_member" "role-binding" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/billing.user"
      + service_account_id = (known after apply)
    }

  # google_service_account_iam_member.role-binding["roles/editor"] will be created
  + resource "google_service_account_iam_member" "role-binding" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/editor"
      + service_account_id = (known after apply)
    }

  # google_service_account_iam_member.role-binding["roles/resourcemanager.projectCreator"] will be created
  + resource "google_service_account_iam_member" "role-binding" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/resourcemanager.projectCreator"
      + service_account_id = (known after apply)
    }

  # google_storage_bucket.bucket will be created
  + resource "google_storage_bucket" "bucket" {
      + bucket_policy_only          = (known after apply)
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "US-CENTRAL1"
      + name                        = "terraform-project0987-tf-bucket"
      + project                     = "terraform-project0987"
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)
    }

  # google_storage_bucket_iam_binding.sa-binding will be created
  + resource "google_storage_bucket_iam_binding" "sa-binding" {
      + bucket  = "terraform-project0987-tf-bucket"
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + role    = "roles/storage.objectAdmin"
    }

  # module.vpc.module.routes.google_compute_route.route["egress-to-internet"] will be created
  + resource "google_compute_route" "route" {
      + description            = "route through IGW to access internet"
      + dest_range             = "0.0.0.0/0"
      + id                     = (known after apply)
      + name                   = "egress-to-internet"
      + network                = "my-network"
      + next_hop_gateway       = "default-internet-gateway"
      + next_hop_instance_zone = (known after apply)
      + next_hop_ip            = (known after apply)
      + next_hop_network       = (known after apply)
      + priority               = 1000
      + project                = "terraform-project0987"
      + self_link              = (known after apply)
      + tags                   = [
          + "egress-inet",
        ]
    }

  # module.vpc.module.subnets.google_compute_subnetwork.subnetwork["us-central1/subnet-02"] will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + ip_cidr_range              = "10.128.30.0/24"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "subnet-02"
      + network                    = "my-network"
      + private_ip_google_access   = false
      + private_ipv6_google_access = (known after apply)
      + project                    = "terraform-project0987"
      + purpose                    = (known after apply)
      + region                     = "us-central1"
      + secondary_ip_range         = []
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)

      + log_config {
          + aggregation_interval = "INTERVAL_10_MIN"
          + filter_expr          = "true"
          + flow_sampling        = 0.7
          + metadata             = "INCLUDE_ALL_METADATA"
        }
    }

  # module.vpc.module.subnets.google_compute_subnetwork.subnetwork["us-west1/subnet-01"] will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + creation_timestamp         = (known after apply)
      + description                = "us-west1 subnet"
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + ip_cidr_range              = "10.138.20.0/24"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "subnet-01"
      + network                    = "my-network"
      + private_ip_google_access   = true
      + private_ipv6_google_access = (known after apply)
      + project                    = "terraform-project0987"
      + purpose                    = (known after apply)
      + region                     = "us-west1"
      + secondary_ip_range         = []
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)

      + log_config {
          + aggregation_interval = "INTERVAL_5_SEC"
          + filter_expr          = "true"
          + flow_sampling        = 0.5
          + metadata             = "INCLUDE_ALL_METADATA"
        }
    }

  # module.vpc.module.vpc.google_compute_network.network will be created
  + resource "google_compute_network" "network" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + mtu                             = 0
      + name                            = "my-network"
      + project                         = "terraform-project0987"
      + routing_mode                    = "GLOBAL"
      + self_link                       = (known after apply)
    }

Plan: 18 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ip = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @avatala, Action: `pull_request`*